config.el

(defun reload-init-file ()
  (interactive)
  (load-file user-init-file)
  (load-file user-init-file))

(use-package eshell-syntax-highlighting
    :after esh-mode
    :config
    (eshell-syntax-highlighting-global-mode +1))

  ;; eshell-syntax-highlighting -- adds fish/zsh-like syntax highlighting.
  ;; eshell-rc-script -- your profile for eshell; like a bashrc for eshell.
  ;; eshell-aliases-file -- sets an aliases file for the eshell.

   ;; eshell-rc-script (concat user-emacs-directory "eshell/profile")
   ;;      eshell-aliases-file (concat user-emacs-directory "eshell/aliases")
   ;; (se
(setq   eshell-history-size 5000
        eshell-buffer-maximum-lines 5000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t
        eshell-destroy-buffer-when-process-dies t
        eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))

;; (use-package vterm
;; :config
;; (setq shell-file-name "/bin/zsh"
;;       vterm-max-scrollback 5000))

;; (use-package vterm-toggle
;;   :after vterm
;;  :config
;;   (setq vterm-toggle-fullscreen-p nil)
;;   (setq vterm-toggle-scope 'project)
;;   (add-to-list 'display-buffer-alist
;;                '((lambda (buffer-or-name _)
;;                      (let ((buffer (get-buffer buffer-or-name)))
;;                        (with-current-buffer buffer
;;                          (or (equal major-mode 'vterm-mode)
;;                              (string-prefix-p vterm-buffer-name (buffer-name buffer))))))
;;                   (display-buffer-reuse-window display-buffer-at-bottom)
;;                   ;;(display-buffer-reuse-window display-buffer-in-direction)
;;                   ;;display-buffer-in-direction/direction/dedicated is added in emacs27
;;                   ;;(direction . bottom)
;;                   ;;(dedicated . t) ;dedicated is supported in emacs27
;;                   (reusable-frames . visible)
;;                   (window-height . 0.3))))

(use-package sudo-edit
  :config
    (nathan/leader-keys
      "fu" '(sudo-edit-find-file :wk "Sudo find file")
      "fU" '(sudo-edit :wk "Sudo edit file")))

(add-to-list 'custom-theme-load-path "~/.config/emacs/themes/")
(load-theme 'light-kiss t)

(use-package which-key
  :init
    (which-key-mode 1)
  :config
  (setq which-key-side-window-location 'bottom
	which-key-sort-order #'which-key-key-order-alpha
	which-key-sort-uppercase-first nil
	which-key-add-column-padding 1
	which-key-max-display-columns nil
	which-key-min-display-lines 6
	which-key-side-window-slot -10
	which-key-side-window-max-height 0.25
	which-key-idle-delay 0.8
	which-key-max-description-length 25
	which-key-allow-imprecise-window-fit t
	which-key-separator " → " ))
